hca-api-stub/hasan-1-raw.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns="http://va.gov/schema/esr/voa/v1" xmlns:ns2="http://jaxws.webservices.esr.med.va.gov/schemas">
   <soapenv:Header/>
   <soapenv:Body>
      <submitFormRequest>
   <form>
 
    <formIdentifier>
        <type>100</type>
        <value>1010EZ</value>
    </formIdentifier>
    <summary>
        <ns2:demographics>
            <ns2:appointmentRequestResponse>true</ns2:appointmentRequestResponse>
            <ns2:contactInfo>
                <ns2:addresses>
                    <ns2:address>
                        <ns2:city>Jacksonville</ns2:city>
                        <ns2:country>USA</ns2:country>
                        <ns2:line1>232 FAKE Dr</ns2:line1>
                        <ns2:state>NC</ns2:state>
                        <ns2:zipCode>28540</ns2:zipCode>
                        <ns2:addressTypeCode>P</ns2:addressTypeCode>
                    </ns2:address>
                </ns2:addresses>
            </ns2:contactInfo>
            <ns2:ethnicity>2186-5</ns2:ethnicity>
            <ns2:maritalStatus>M</ns2:maritalStatus>
            <ns2:preferredFacility>608</ns2:preferredFacility>
            <ns2:races>
                <ns2:race>2106-3</ns2:race>
            </ns2:races>
            <ns2:acaIndicator>false</ns2:acaIndicator>
        </ns2:demographics>
        <ns2:enrollmentDeterminationInfo>
            <ns2:eligibleForMedicaid>false</ns2:eligibleForMedicaid>
            <ns2:noseThroatRadiumInfo>
                <ns2:receivingTreatment>false</ns2:receivingTreatment>
            </ns2:noseThroatRadiumInfo>
            <ns2:serviceConnectionAward>
                <ns2:serviceConnectedIndicator>false</ns2:serviceConnectedIndicator>
            </ns2:serviceConnectionAward>
            <ns2:specialFactors>
                <ns2:agentOrangeInd>false</ns2:agentOrangeInd>
                <ns2:envContaminantsInd>false</ns2:envContaminantsInd>
                <ns2:campLejeuneInd>false</ns2:campLejeuneInd>
               <ns2:radiationExposureInd>false</ns2:radiationExposureInd>
            </ns2:specialFactors>
        </ns2:enrollmentDeterminationInfo>
        <ns2:insuranceList>
            <ns2:insurance>
                <ns2:companyName>Medicare</ns2:companyName>
                <ns2:enrolledInPartA>false</ns2:enrolledInPartA>
                <ns2:enrolledInPartB>false</ns2:enrolledInPartB>
                <ns2:insuranceMappingTypeName>MDCR</ns2:insuranceMappingTypeName>
            </ns2:insurance>
        </ns2:insuranceList>
        <ns2:militaryServiceInfo>
            <ns2:disabilityRetirementIndicator>false</ns2:disabilityRetirementIndicator>
            <ns2:dischargeDueToDisability>false</ns2:dischargeDueToDisability>
            <ns2:militaryServiceSiteRecords>
                <ns2:militaryServiceSiteRecord>
                    <ns2:militaryServiceEpisodes>
                        <ns2:militaryServiceEpisode>
                            <ns2:endDate>06/28/2015</ns2:endDate>
                            <ns2:serviceBranch>4</ns2:serviceBranch>
                            <ns2:startDate>08/08/2004</ns2:startDate>
                            <ns2:dischargeType>1</ns2:dischargeType>
                        </ns2:militaryServiceEpisode>
                    </ns2:militaryServiceEpisodes>
                    <ns2:site>565GC</ns2:site>
                </ns2:militaryServiceSiteRecord>
            </ns2:militaryServiceSiteRecords>
        </ns2:militaryServiceInfo>
        <ns2:prisonerOfWarInfo>
            <ns2:powIndicator>false</ns2:powIndicator>
        </ns2:prisonerOfWarInfo>
        <ns2:purpleHeart>
            <ns2:indicator>false</ns2:indicator>
        </ns2:purpleHeart>
        <ns2:personInfo>
            <ns2:firstName>SAL</ns2:firstName>
            <ns2:middleName>F</ns2:middleName>
            <ns2:lastName>VOASAL</ns2:lastName>
            <ns2:ssnText>498745223</ns2:ssnText>
            <ns2:gender>M</ns2:gender>
            <ns2:dob>02/08/1981</ns2:dob>
            <ns2:mothersMaidenName>Young</ns2:mothersMaidenName>
            <ns2:placeOfBirthCity>Mt Vernon</ns2:placeOfBirthCity>
            <ns2:placeOfBirthState>MO</ns2:placeOfBirthState>
        </ns2:personInfo>
    </summary>
    <applications>
        <applicationInfo>
            <appDate>2015-12-21</appDate>
            <appMethod>1</appMethod>
        </applicationInfo>
    </applications>
</form>
 
 
<identity>
          
            <!--only type matters, value does not matter
                      Code  ANONYMOUS = new Code("100");
                      Code  DS_LOGON_LEVEL_1 = new Code("101");
                      Code  DS_LOGON_LEVEL_2 = new Code("102");
                      Code  DS_LOGON_LEVEL_3 = new Code("103");
                      Code  DS_LOGON_LEVEL_4 = new Code("104");-->
            <authenticationLevel>
               <type>100</type>
               <!--optional not required-->
               <value>anonymous</value>
            </authenticationLevel>
</identity>
 
      </submitFormRequest>
   </soapenv:Body>
</soapenv:Envelope>